docs: update architecture diagram
